
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hito1991/aws-ecs-terraform/actions/runs/7276938450)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-054815ee42e698c78]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02373311b2da3577e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b757b327cfadf5bc]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0618c79d2329f7595]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0312259101dd7ed7a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04b70642bce536260]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0369ec0e37dc36ad9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01eb1db15aa20540b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0c809db5600d00892]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0322d3fc7701247b9]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09b6624041ec92195]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08523ac720dda1864]
aws_security_group.ecs: Refreshing state... [id=sg-04141638f33bbb89a]
aws_security_group.alb: Refreshing state... [id=sg-02df84af4230ab692]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ad6fcdea1e056c91]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09e3dc784389d9586]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0312259101dd7ed7a1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09e8979b16fa91f08]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d8732445b2c7e42b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08256c2b81bd646e1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03bff2c6743ffb031]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3377403824]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ecfb5f7cfdfa1bde]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0956d55a039c2db70]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09b6624041ec921951080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0c809db5600d008921080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "go-simple-server-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-02df84af4230ab692",
        ]
      + subnets                                                      = [
          + "subnet-0322d3fc7701247b9",
          + "subnet-08523ac720dda1864",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-054815ee42e698c78"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:targetgroup/go-simple-server-target-group/ec92018886c7dd47]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Creation complete after 2m56s [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:loadbalancer/app/go-simple-server-alb/1d6a8fef77710419]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:listener/app/go-simple-server-alb/1d6a8fef77710419/902f52493aff1692]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:listener-rule/app/go-simple-server-alb/1d6a8fef77710419/902f52493aff1692/6170cc4a70690a54]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":9,"Program":"tfcmt","SHA1":"15c7e7ef0a25cfe79c3d5bba66e38dbc60c302af","Vars":{},"WorkflowName":"Terraform"} -->